Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase.GetEnumerator Method
 Allows the usage of the foreach statement with DrawingObjectEnumerator.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
A pointer to the existing instance of the class.
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace